/*********************************************************************************************************
* 模块名称：RCU.c
* 摘    要：RCU模块，复位和时钟单元
* 当前版本：1.0.0
* 作    者：Rengar
* 完成日期：2024年01月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容:
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "RCU.h"
#include "gd32f30x_conf.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void  ConfigRCU(void);  //配置RCU

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称：ConfigRCU
* 函数功能：配置RCU
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 完成日期：2024年01月01日 
* 注    意：配置的时钟如下：
*           （1）PLLCLK（PLL时钟）    = 120MHz
*           （2）SYSCLK（系统时钟）   = 120MHz
*           （3）HCLK（AHB总线时钟）  = 120MHz
*           （4）PCLK1（APB1总线时钟）= 60MHz
*           （5）PCLK2（APB2总线时钟）= 120MHz

Flash 等待周期（FMC WS）
你现在是 WS_WSCNT_1，对于 120 MHz 不够，容易HardFault/跑飞。
GD32F30x 常见推荐（典型值）：

0–24 MHz：WS0

24–48 MHz：WS1

48–72 MHz：WS2

72–96 MHz：WS3

96–120 MHz：WS4 ?
*********************************************************************************************************/
static void ConfigRCU(void)
{

	ErrStatus HXTALStartUpStatus;
	rcu_deinit();
	rcu_osci_on(RCU_HXTAL);
	HXTALStartUpStatus = rcu_osci_stab_wait(RCU_HXTAL);
	if(HXTALStartUpStatus == SUCCESS)
	{
		fmc_wscnt_set(WS_WSCNT_2);
		rcu_ahb_clock_config(RCU_AHB_CKSYS_DIV1);
		rcu_apb2_clock_config(RCU_APB2_CKAHB_DIV1);
		rcu_apb1_clock_config(RCU_APB1_CKAHB_DIV2);
		
		rcu_pllpresel_config(RCU_PLLPRESRC_HXTAL);
		rcu_predv0_config(RCU_PREDV0_DIV1);
		rcu_pll_config(RCU_PLLSRC_HXTAL_IRC48M,RCU_PLL_MUL15);  //8*9
		rcu_osci_on(RCU_PLL_CK);
		while(0U == rcu_flag_get(RCU_FLAG_PLLSTB))
		{
		}
		rcu_system_clock_source_config(RCU_CKSYSSRC_PLL);
		while(0U == rcu_system_clock_source_get())
		{
		}
	}
/*
	ErrStatus LXTALStartUpStatus;
	rcu_deinit();
	rcu_osci_on(RCU_LXTAL);
	LXTALStartUpStatus = rcu_osci_stab_wait(RCU_LXTAL);
	if(LXTALStartUpStatus == SUCCESS)
	{
		fmc_wscnt_set(WS_WSCNT_1);
		rcu_ahb_clock_config(RCU_AHB_CKSYS_DIV1);
		rcu_apb2_clock_config(RCU_APB2_CKAHB_DIV1);
		rcu_apb1_clock_config(RCU_APB1_CKAHB_DIV2);
		
	//	rcu_pllpresel_config(RCU_PLLPRESRC_HXTAL);
	//	rcu_predv0_config(RCU_PREDV0_DIV1);
	//	rcu_pll_config(RCU_PLLSRC_HXTAL_IRC48M,RCU_PLL_MUL15);
	//	rcu_osci_on(RCU_PLL_CK);
	//	while(0U == rcu_flag_get(RCU_FLAG_PLLSTB))
	//	{
	//	}
	//	rcu_system_clock_source_config(RCU_CKSYSSRC_PLL);
		while(0U == rcu_system_clock_source_get())
		{
		}
	}
	*/
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitRCU
* 函数功能：初始化RCU模块 
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月01日 
* 注    意：
*********************************************************************************************************/
void InitRCU(void)
{
  ConfigRCU();  //配置RCU
}









